import React, { useState } from "react";

import ResponsiveDrawer from "../ResponsiveDrawer/ResponsiveDrawer";
import Announcements from "../Announcements/Announcements";

let data = [
  {
    "photo": [
      "https://1house.by/wp-content/uploads/2019/01/6-konechn.jpg",
      "https://1house.by/wp-content/uploads/2019/01/6-konechn.jpg",
      "https://1house.by/wp-content/uploads/2019/01/6-konechn.jpg"
    ],
    "properti": {
      "ID": 19,
      "contractID": 11,
      "city": "Минск",
      "street": "Сурганова",
      "house": "45",
      "apartm": 345,
      "floor": 3,
      "rooms": 2,
      "balcony": 1,
      "area": 80.0,
      "description": "Для строителей, рабочих. Сдам на длительный срок 3-х комнатную квартиру, г. Минск, ул. Слободская, дом 135-1, р-н Малиновка 8/12 этажного панельного дома, мебель, сан/узел - раздельный, ремонт - отличный ремонт, электрическая плита, площадь 63.1/63.1/ кв.м., балкон застекленный, домофон, металлическая дверь, лифт, парковка, хороший вид из окна, детская площадка, рядом магазин, рядом супермаркет, рядом гипермаркет, рядом рынок. Для проживания строительных бригад. Отопление, горячая и холодная вода, интернет wifi,чайник,микроволновая печь,холодильник,кровати 8 шт.,подушка,одеяло (постельное белье)уборщица 2-3 раза в неделю,постельное белье сдается в химчистку. Одноуровневые кровати. На длительный срок аренды (от месяца).Рядом остановка,автобуса. Коммунальные входят в стоимость. 10 рублей с человека в день Минск, Слободская улица",
      "AdmChek": 1
    },
    "name": "Патрик",
    "Phone": "+375336548711"
  },
  {
    "photo": [
      "https://spot.by/NewsImages/5_2.jpg",
    ],
    "properti": {
      "ID": 22,
      "contractID": 12,
      "city": "Минск",
      "street": "Независимости",
      "house": "145",
      "apartm": 32,
      "floor": 2,
      "rooms": 1,
      "balcony": 1,
      "area": 50.0,
      "description": "Просторная однокомнатная квартира на первом этаже. Есть собственный тамбур - он только на одну квартиру. Можно оставлять там коляски, велосипеды и прочие вещи. С кухни есть выход на лоджию. Санузел просторный, совмещенный. Есть ванна. Много спальных мест - удобная двуспальная кровать, раскладной диван. Места для хранения - шкафы, комод, тумба.",
      "AdmChek": 1
    },
    "name": "Иван",
    "Phone": "+375331234567"
  },
  {
    "photo": [
      "https://spot.by/NewsImages/5_2.jpg",
    ],
    "properti": {
      "ID": 21,
      "contractID": 12,
      "city": "Минск",
      "street": "Независимости",
      "house": "145",
      "apartm": 32,
      "floor": 2,
      "rooms": 1,
      "balcony": 1,
      "area": 50.0,
      "description": "Просторная однокомнатная квартира на первом этаже. Есть собственный тамбур - он только на одну квартиру. Можно оставлять там коляски, велосипеды и прочие вещи. С кухни есть выход на лоджию. Санузел просторный, совмещенный. Есть ванна. Много спальных мест - удобная двуспальная кровать, раскладной диван. Места для хранения - шкафы, комод, тумба.",
      "AdmChek": 1
    },
    "name": "Иван",
    "Phone": "+375331234567"
  },
  {
    "photo": [
      "https://spot.by/NewsImages/5_2.jpg",
    ],
    "properti": {
      "ID": 25,
      "contractID": 12,
      "city": "Минск",
      "street": "Независимости",
      "house": "145",
      "apartm": 32,
      "floor": 2,
      "rooms": 1,
      "balcony": 1,
      "area": 50.0,
      "description": "Просторная однокомнатная квартира на первом этаже. Есть собственный тамбур - он только на одну квартиру. Можно оставлять там коляски, велосипеды и прочие вещи. С кухни есть выход на лоджию. Санузел просторный, совмещенный. Есть ванна. Много спальных мест - удобная двуспальная кровать, раскладной диван. Места для хранения - шкафы, комод, тумба.",
      "AdmChek": 1
    },
    "name": "Иван",
    "Phone": "+375331234567"
  }
]

const RealtorPanel = () => {
  const [selectItem, setSelectItem] = useState(1); 

  const menu = [
    {
      id: 1,
      name: "Объявления",
      onClick: () => setSelectItem(1)
    },
    {
      id: 2,
      name: "На обработке",
      onClick: () => setSelectItem(2)
    }
  ];

  return (
    <ResponsiveDrawer menu={menu}>
      <Announcements announcements={data} />
    </ResponsiveDrawer>
  );
}

export default RealtorPanel;